Ran Plan for project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.fileflow_ecr_access will be created
+ resource "aws_iam_role_policy" "fileflow_ecr_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-ecr-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # aws_iam_role_policy.fileflow_secrets_access will be created
+ resource "aws_iam_role_policy" "fileflow_secrets_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # module.fileflow_alb.aws_lb_target_group.this["fileflow"] will be updated in-place
~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-prod-alb-fileflow/0282974f4dcfd0de"
        name                               = "fileflow-prod-alb-fileflow"
        tags                               = {
            "Component"   = "load-balancer"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "Target group for fileflow-prod-alb - fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow-prod-alb-fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/actuator/health" -> "/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/fileflow-prod/fileflow"
        name                               = "fileflow"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:16" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "fileflow" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecs-service%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecs-prod
  ```
Plan: 3 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```